[Killed] ConditionalExpression
api/users/update/route.js:14:9
     // Obtém a sessão do usuário autenticado
     const session = await getServerSession()
     
-    if (!session?.user?.email) {
+    if (false) {
       return NextResponse.json(
         { success: false, message: "Não autenticado" },
killedBy: PUT /api/users/update TDD-FAIL: deve retornar 401 se o usuário não estiver autenticado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 401
Received: 500

[Killed] BooleanLiteral
api/users/update/route.js:14:9
     // Obtém a sessão do usuário autenticado
     const session = await getServerSession()
     
-    if (!session?.user?.email) {
+    if (session?.user?.email) {
       return NextResponse.json(
         { success: false, message: "Não autenticado" },
killedBy: PUT /api/users/update TDD-FAIL: deve retornar 401 se o usuário não estiver autenticado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 401
Received: 500

[Survived] BooleanLiteral
api/users/update/route.js:16:20
     
     if (!session?.user?.email) {
       return NextResponse.json(
-        { success: false, message: "Não autenticado" },
+        { success: true, message: "Não autenticado" },
         { status: 401 }
       )

[Killed] StringLiteral
api/users/update/route.js:16:36
     
     if (!session?.user?.email) {
       return NextResponse.json(
-        { success: false, message: "Não autenticado" },
+        { success: false, message: "" },
         { status: 401 }
       )
killedBy: PUT /api/users/update TDD-FAIL: deve retornar 401 se o usuário não estiver autenticado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Não autenticado"
Received: ""

[Killed] LogicalOperator
api/users/update/route.js:23:9
 
     const { name, email, currentPassword, newPassword } = await request.json()
 
-    if (!name || !email) {
+    if (!name && !email) {
       return NextResponse.json(
         { success: false, message: "Nome e email são obrigatórios" },
killedBy: PUT /api/users/update TDD-FAIL: deve retornar 400 se faltarem 'name' ou 'email'
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Nome e email são obrigatórios"
Received: "Este email já está em uso"

[Killed] ConditionalExpression
api/users/update/route.js:23:9
 
     const { name, email, currentPassword, newPassword } = await request.json()
 
-    if (!name || !email) {
+    if (false) {
       return NextResponse.json(
         { success: false, message: "Nome e email são obrigatórios" },
killedBy: PUT /api/users/update TDD-FAIL: deve retornar 400 se faltarem 'name' ou 'email'
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Nome e email são obrigatórios"
Received: "Este email já está em uso"

[Survived] BooleanLiteral
api/users/update/route.js:25:20
 
     if (!name || !email) {
       return NextResponse.json(
-        { success: false, message: "Nome e email são obrigatórios" },
+        { success: true, message: "Nome e email são obrigatórios" },
         { status: 400 }
       )

[Killed] ObjectLiteral
api/users/update/route.js:25:9
 
     if (!name || !email) {
       return NextResponse.json(
-        { success: false, message: "Nome e email são obrigatórios" },
+        {},
         { status: 400 }
       )
killedBy: PUT /api/users/update TDD-FAIL: deve retornar 400 se faltarem 'name' ou 'email'
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Nome e email são obrigatórios"
Received: undefined

[Survived] ObjectLiteral
api/users/update/route.js:31:54
     }
 
     // Busca o usuário atual
-    const currentUser = await prisma.user.findUnique({
-      where: { email: session.user.email }
-    })
+    const currentUser = await prisma.user.findUnique({})
 
     if (!currentUser) {

[Killed] ConditionalExpression
api/users/update/route.js:35:9
       where: { email: session.user.email }
     })
 
-    if (!currentUser) {
+    if (true) {
       return NextResponse.json(
         { success: false, message: "Usuário não encontrado" },
killedBy: PUT /api/users/update TDD-FAIL: deve retornar 400 se o novo email já estiver em uso por outro usuário
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 404

[Killed] BooleanLiteral
api/users/update/route.js:35:9
       where: { email: session.user.email }
     })
 
-    if (!currentUser) {
+    if (currentUser) {
       return NextResponse.json(
         { success: false, message: "Usuário não encontrado" },
killedBy: PUT /api/users/update TDD-FAIL: deve retornar 400 se o novo email já estiver em uso por outro usuário
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 404

[NoCoverage] BooleanLiteral
api/users/update/route.js:37:20
 
     if (!currentUser) {
       return NextResponse.json(
-        { success: false, message: "Usuário não encontrado" },
+        { success: true, message: "Usuário não encontrado" },
         { status: 404 }
       )

[Killed] ConditionalExpression
api/users/update/route.js:43:9
     }
 
     // Verifica se o email já existe (se diferente do atual)
-    if (email !== currentUser.email) {
+    if (true) {
       const existingUser = await prisma.user.findUnique({
         where: { email }
killedBy: PUT /api/users/update TDD-FAIL: deve retornar 400 se 'newPassword' for fornecida sem 'currentPassword'
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Senha atual é obrigatória para alterar a senha"
Received: "Este email já está em uso"

[Killed] EqualityOperator
api/users/update/route.js:43:9
     }
 
     // Verifica se o email já existe (se diferente do atual)
-    if (email !== currentUser.email) {
+    if (email === currentUser.email) {
       const existingUser = await prisma.user.findUnique({
         where: { email }
killedBy: PUT /api/users/update TDD-FAIL: deve retornar 400 se o novo email já estiver em uso por outro usuário
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] BlockStatement
api/users/update/route.js:48:25
         where: { email }
       })
 
-      if (existingUser) {
-        return NextResponse.json(
-          { success: false, message: "Este email já está em uso" },
-          { status: 400 }
-        )
-      }
+      if (existingUser) {}
     }
 
killedBy: PUT /api/users/update TDD-FAIL: deve retornar 400 se o novo email já estiver em uso por outro usuário
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Survived] BooleanLiteral
api/users/update/route.js:50:22
 
       if (existingUser) {
         return NextResponse.json(
-          { success: false, message: "Este email já está em uso" },
+          { success: true, message: "Este email já está em uso" },
           { status: 400 }
         )

[Killed] ObjectLiteral
api/users/update/route.js:50:11
 
       if (existingUser) {
         return NextResponse.json(
-          { success: false, message: "Este email já está em uso" },
+          {},
           { status: 400 }
         )
killedBy: PUT /api/users/update TDD-FAIL: deve retornar 400 se o novo email já estiver em uso por outro usuário
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Este email já está em uso"
Received: undefined

[Killed] ObjectLiteral
api/users/update/route.js:51:11
       if (existingUser) {
         return NextResponse.json(
           { success: false, message: "Este email já está em uso" },
-          { status: 400 }
+          {}
         )
       }
killedBy: PUT /api/users/update TDD-FAIL: deve retornar 400 se o novo email já estiver em uso por outro usuário
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] ConditionalExpression
api/users/update/route.js:63:9
     }
 
     // Se quiser alterar a senha
-    if (newPassword) {
+    if (false) {
       if (!currentPassword) {
         return NextResponse.json(
killedBy: PUT /api/users/update TDD-FAIL: deve retornar 400 se 'newPassword' for fornecida sem 'currentPassword'
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] ConditionalExpression
api/users/update/route.js:63:9
     }
 
     // Se quiser alterar a senha
-    if (newPassword) {
+    if (true) {
       if (!currentPassword) {
         return NextResponse.json(
killedBy: PUT /api/users/update TDD-SUCCESS: deve atualizar nome e email com sucesso (sem alterar senha)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] ConditionalExpression
api/users/update/route.js:64:11
 
     // Se quiser alterar a senha
     if (newPassword) {
-      if (!currentPassword) {
+      if (false) {
         return NextResponse.json(
           { success: false, message: "Senha atual é obrigatória para alterar a senha" },
killedBy: PUT /api/users/update TDD-FAIL: deve retornar 400 se 'newPassword' for fornecida sem 'currentPassword'
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] BooleanLiteral
api/users/update/route.js:64:11
 
     // Se quiser alterar a senha
     if (newPassword) {
-      if (!currentPassword) {
+      if (currentPassword) {
         return NextResponse.json(
           { success: false, message: "Senha atual é obrigatória para alterar a senha" },
killedBy: PUT /api/users/update TDD-FAIL: deve retornar 400 se 'newPassword' for fornecida sem 'currentPassword'
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Survived] BooleanLiteral
api/users/update/route.js:66:22
     if (newPassword) {
       if (!currentPassword) {
         return NextResponse.json(
-          { success: false, message: "Senha atual é obrigatória para alterar a senha" },
+          { success: true, message: "Senha atual é obrigatória para alterar a senha" },
           { status: 400 }
         )

[Killed] ConditionalExpression
api/users/update/route.js:71:11
         )
       }
 
-      if (newPassword.length < 6) {
+      if (true) {
         return NextResponse.json(
           { success: false, message: "Nova senha deve ter pelo menos 6 caracteres" },
killedBy: PUT /api/users/update TDD-FAIL: deve retornar 400 se a 'currentPassword' estiver incorreta
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Senha atual incorreta"
Received: "Nova senha deve ter pelo menos 6 caracteres"

[Killed] ConditionalExpression
api/users/update/route.js:71:11
         )
       }
 
-      if (newPassword.length < 6) {
+      if (false) {
         return NextResponse.json(
           { success: false, message: "Nova senha deve ter pelo menos 6 caracteres" },
killedBy: PUT /api/users/update TDD-FAIL: deve retornar 400 se 'newPassword' for menor que 6 caracteres
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Survived] BooleanLiteral
api/users/update/route.js:73:22
 
       if (newPassword.length < 6) {
         return NextResponse.json(
-          { success: false, message: "Nova senha deve ter pelo menos 6 caracteres" },
+          { success: true, message: "Nova senha deve ter pelo menos 6 caracteres" },
           { status: 400 }
         )

[Killed] ObjectLiteral
api/users/update/route.js:73:11
 
       if (newPassword.length < 6) {
         return NextResponse.json(
-          { success: false, message: "Nova senha deve ter pelo menos 6 caracteres" },
+          {},
           { status: 400 }
         )
killedBy: PUT /api/users/update TDD-FAIL: deve retornar 400 se 'newPassword' for menor que 6 caracteres
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Nova senha deve ter pelo menos 6 caracteres"
Received: undefined

[Killed] BlockStatement
api/users/update/route.js:79:33
       }
 
       // Verifica a senha atual
-      if (currentUser.password) {
-        const isCurrentPasswordValid = await bcrypt.compare(
-          currentPassword,
-          currentUser.password
-        )
-
-        if (!isCurrentPasswordValid) {
-          return NextResponse.json(
-            { success: false, message: "Senha atual incorreta" },
-            { status: 400 }
-          )
-        }
-      }
+      if (currentUser.password) {}
 
       // Hash da nova senha
killedBy: PUT /api/users/update TDD-FAIL: deve retornar 400 se a 'currentPassword' estiver incorreta
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] ConditionalExpression
api/users/update/route.js:79:11
       }
 
       // Verifica a senha atual
-      if (currentUser.password) {
+      if (false) {
         const isCurrentPasswordValid = await bcrypt.compare(
           currentPassword,
killedBy: PUT /api/users/update TDD-FAIL: deve retornar 400 se a 'currentPassword' estiver incorreta
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] BooleanLiteral
api/users/update/route.js:85:13
           currentUser.password
         )
 
-        if (!isCurrentPasswordValid) {
+        if (isCurrentPasswordValid) {
           return NextResponse.json(
             { success: false, message: "Senha atual incorreta" },
killedBy: PUT /api/users/update TDD-FAIL: deve retornar 400 se a 'currentPassword' estiver incorreta
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] BlockStatement
api/users/update/route.js:85:38
           currentUser.password
         )
 
-        if (!isCurrentPasswordValid) {
-          return NextResponse.json(
-            { success: false, message: "Senha atual incorreta" },
-            { status: 400 }
-          )
-        }
+        if (!isCurrentPasswordValid) {}
       }
 
killedBy: PUT /api/users/update TDD-FAIL: deve retornar 400 se a 'currentPassword' estiver incorreta
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Survived] BooleanLiteral
api/users/update/route.js:87:24
 
         if (!isCurrentPasswordValid) {
           return NextResponse.json(
-            { success: false, message: "Senha atual incorreta" },
+            { success: true, message: "Senha atual incorreta" },
             { status: 400 }
           )

[Killed] ObjectLiteral
api/users/update/route.js:88:13
         if (!isCurrentPasswordValid) {
           return NextResponse.json(
             { success: false, message: "Senha atual incorreta" },
-            { status: 400 }
+            {}
           )
         }
killedBy: PUT /api/users/update TDD-FAIL: deve retornar 400 se a 'currentPassword' estiver incorreta
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Survived] BooleanLiteral
api/users/update/route.js:105:16
         id: true,
         name: true,
         email: true,
-        image: true,
+        image: false,
         createdAt: true,
         updatedAt: true

[Survived] BooleanLiteral
api/users/update/route.js:106:20
         name: true,
         email: true,
         image: true,
-        createdAt: true,
+        createdAt: false,
         updatedAt: true
       }

[Survived] BooleanLiteral
api/users/update/route.js:107:20
         email: true,
         image: true,
         createdAt: true,
-        updatedAt: true
+        updatedAt: false
       }
     })

[Killed] BooleanLiteral
api/users/update/route.js:112:16
     })
 
     return NextResponse.json({
-      success: true,
+      success: false,
       message: "Perfil atualizado com sucesso",
       data: updatedUser
killedBy: PUT /api/users/update TDD-SUCCESS: deve atualizar nome e email com sucesso (sem alterar senha)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] StringLiteral
api/users/update/route.js:113:16
 
     return NextResponse.json({
       success: true,
-      message: "Perfil atualizado com sucesso",
+      message: "",
       data: updatedUser
     })

[Killed] BlockStatement
api/users/update/route.js:117:19
       data: updatedUser
     })
 
-  } catch (error) {
-    console.error("Update error:", error)
-    return NextResponse.json(
-      { success: false, message: "Erro interno do servidor" },
-      { status: 500 }
-    )
-  }
+  } catch (error) {}
 }
killedBy: PUT /api/users/update TDD-COV: deve retornar 500 se ocorrer um erro interno do servidor (catch block)
statusReason: TypeError: Cannot read properties of undefined (reading 'json')

[Killed] BooleanLiteral
api/users/update/route.js:120:18
   } catch (error) {
     console.error("Update error:", error)
     return NextResponse.json(
-      { success: false, message: "Erro interno do servidor" },
+      { success: true, message: "Erro interno do servidor" },
       { status: 500 }
     )
killedBy: PUT /api/users/update TDD-COV: deve retornar 500 se ocorrer um erro interno do servidor (catch block)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
