[Killed] LogicalOperator
api/auth/signup/route.js:13:9
     const { name, email, password } = await request.json()
 
     // Validações
-    if (!name || !email || !password) {
+    if ((!name || !email) && !password) {
       return NextResponse.json(
         { 
killedBy: POST /api/auth/signup deve retornar 400 se faltarem nome, email ou senha
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Nome, email e senha são obrigatórios"
Received: "Senha deve ter pelo menos 6 caracteres"

[Killed] BooleanLiteral
api/auth/signup/route.js:13:28
     const { name, email, password } = await request.json()
 
     // Validações
-    if (!name || !email || !password) {
+    if (!name || !email || password) {
       return NextResponse.json(
         { 
killedBy: POST /api/auth/signup deve retornar 400 se faltarem nome, email ou senha
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Nome, email e senha são obrigatórios"
Received: "Senha deve ter pelo menos 6 caracteres"

[Killed] StringLiteral
api/auth/signup/route.js:17:20
       return NextResponse.json(
         { 
           success: false,
-          message: "Nome, email e senha são obrigatórios" 
+          message: "" 
         },
         { status: 400 }
killedBy: POST /api/auth/signup deve retornar 400 se faltarem nome, email ou senha
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Nome, email e senha são obrigatórios"
Received: ""

[Killed] ConditionalExpression
api/auth/signup/route.js:23:9
       )
     }
 
-    if (password.length < 6) {
+    if (false) {
       return NextResponse.json(
         { 
killedBy: POST /api/auth/signup deve retornar 400 se a senha for muito curta (< 6 caracteres)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 201

[Killed] BlockStatement
api/auth/signup/route.js:23:30
       )
     }
 
-    if (password.length < 6) {
-      return NextResponse.json(
-        { 
-          success: false,
-          message: "Senha deve ter pelo menos 6 caracteres" 
-        },
-        { status: 400 }
-      )
-    }
+    if (password.length < 6) {}
 
     // Verifica se o usuário já existe
killedBy: POST /api/auth/signup deve retornar 400 se a senha for muito curta (< 6 caracteres)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 201

[Killed] StringLiteral
api/auth/signup/route.js:27:20
       return NextResponse.json(
         { 
           success: false,
-          message: "Senha deve ter pelo menos 6 caracteres" 
+          message: "" 
         },
         { status: 400 }
killedBy: POST /api/auth/signup deve retornar 400 se a senha for muito curta (< 6 caracteres)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Senha deve ter pelo menos 6 caracteres"
Received: ""

[Survived] ObjectLiteral
api/auth/signup/route.js:52:43
     const hashedPassword = await bcrypt.hash(password, 12)
 
     // Cria o usuário
-    const user = await prisma.user.create({
-      data: {
-        name,
-        email,
-        password: hashedPassword,
-      },
-      select: {
-        id: true,
-        name: true,
-        email: true,
-        createdAt: true
-      }
-    })
+    const user = await prisma.user.create({})
 
     return NextResponse.json(

[Survived] BooleanLiteral
api/auth/signup/route.js:62:20
         id: true,
         name: true,
         email: true,
-        createdAt: true
+        createdAt: false
       }
     })

[Killed] BlockStatement
api/auth/signup/route.js:75:19
       { status: 201 }
     )
 
-  } catch (error) {
-    console.error("Signup error:", error)
-    return NextResponse.json(
-      { 
-        success: false,
-        message: "Erro interno do servidor" 
-      },
-      { status: 500 }
-    )
-  }
+  } catch (error) {}
 }
 
killedBy: POST /api/auth/signup deve retornar 500 se ocorrer um erro interno do servidor (catch block)
statusReason: TypeError: Cannot read properties of undefined (reading 'json')

[Killed] ObjectLiteral
api/auth/signup/route.js:78:7
   } catch (error) {
     console.error("Signup error:", error)
     return NextResponse.json(
-      { 
-        success: false,
-        message: "Erro interno do servidor" 
-      },
+      {},
       { status: 500 }
     )
killedBy: POST /api/auth/signup deve retornar 500 se ocorrer um erro interno do servidor (catch block)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined
