[Killed] OptionalChaining
api/users/delete/route.js:13:10
   try {
     const session = await getServerSession()
     
-    if (!session?.user?.email) {
+    if (!session.user?.email) {
       return NextResponse.json(
         { success: false, message: "Não autenticado" },
killedBy: DELETE /api/users/delete TDD-FAIL: deve retornar 401 se o usuário não estiver autenticado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 401
Received: 500

[Killed] ObjectLiteral
api/users/delete/route.js:16:9
     if (!session?.user?.email) {
       return NextResponse.json(
         { success: false, message: "Não autenticado" },
-        { status: 401 }
+        {}
       )
     }
killedBy: DELETE /api/users/delete TDD-FAIL: deve retornar 401 se o usuário não estiver autenticado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 401
Received: 200

[Killed] ConditionalExpression
api/users/delete/route.js:22:9
 
     const { password } = await request.json()
 
-    if (!password) {
+    if (true) {
       return NextResponse.json(
         { success: false, message: "Senha é obrigatória para deletar a conta" },
killedBy: DELETE /api/users/delete TDD-FAIL: deve retornar 404 se o usuário não for encontrado (após autenticação)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 400

[Killed] BooleanLiteral
api/users/delete/route.js:22:9
 
     const { password } = await request.json()
 
-    if (!password) {
+    if (password) {
       return NextResponse.json(
         { success: false, message: "Senha é obrigatória para deletar a conta" },
killedBy: DELETE /api/users/delete TDD-FAIL: deve retornar 400 se a senha for omitida
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Survived] BooleanLiteral
api/users/delete/route.js:24:20
 
     if (!password) {
       return NextResponse.json(
-        { success: false, message: "Senha é obrigatória para deletar a conta" },
+        { success: true, message: "Senha é obrigatória para deletar a conta" },
         { status: 400 }
       )

[Killed] ObjectLiteral
api/users/delete/route.js:25:9
     if (!password) {
       return NextResponse.json(
         { success: false, message: "Senha é obrigatória para deletar a conta" },
-        { status: 400 }
+        {}
       )
     }
killedBy: DELETE /api/users/delete TDD-FAIL: deve retornar 400 se a senha for omitida
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Survived] ObjectLiteral
api/users/delete/route.js:31:14
 
     // Busca o usuário atual
     const currentUser = await prisma.user.findUnique({
-      where: { email: session.user.email }
+      where: {}
     })
 

[Killed] BlockStatement
api/users/delete/route.js:34:23
       where: { email: session.user.email }
     })
 
-    if (!currentUser) {
-      return NextResponse.json(
-        { success: false, message: "Usuário não encontrado" },
-        { status: 404 }
-      )
-    }
+    if (!currentUser) {}
 
     // Verifica a senha
killedBy: DELETE /api/users/delete TDD-FAIL: deve retornar 404 se o usuário não for encontrado (após autenticação)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 500

[Killed] ObjectLiteral
api/users/delete/route.js:37:9
     if (!currentUser) {
       return NextResponse.json(
         { success: false, message: "Usuário não encontrado" },
-        { status: 404 }
+        {}
       )
     }
killedBy: DELETE /api/users/delete TDD-FAIL: deve retornar 404 se o usuário não for encontrado (após autenticação)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 200

[Killed] ConditionalExpression
api/users/delete/route.js:42:9
     }
 
     // Verifica a senha
-    if (currentUser.password) {
+    if (false) {
       const isPasswordValid = await bcrypt.compare(
         password,
killedBy: DELETE /api/users/delete TDD-FAIL: deve retornar 400 se a senha estiver incorreta
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] BlockStatement
api/users/delete/route.js:42:31
     }
 
     // Verifica a senha
-    if (currentUser.password) {
-      const isPasswordValid = await bcrypt.compare(
-        password,
-        currentUser.password
-      )
-
-      if (!isPasswordValid) {
-        return NextResponse.json(
-          { success: false, message: "Senha incorreta" },
-          { status: 400 }
-        )
-      }
-    }
+    if (currentUser.password) {}
 
     // Deleta o usuário e suas sessões/contas relacionadas
killedBy: DELETE /api/users/delete TDD-FAIL: deve retornar 400 se a senha estiver incorreta
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] BlockStatement
api/users/delete/route.js:48:29
         currentUser.password
       )
 
-      if (!isPasswordValid) {
-        return NextResponse.json(
-          { success: false, message: "Senha incorreta" },
-          { status: 400 }
-        )
-      }
+      if (!isPasswordValid) {}
     }
 
killedBy: DELETE /api/users/delete TDD-FAIL: deve retornar 400 se a senha estiver incorreta
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] BooleanLiteral
api/users/delete/route.js:48:11
         currentUser.password
       )
 
-      if (!isPasswordValid) {
+      if (isPasswordValid) {
         return NextResponse.json(
           { success: false, message: "Senha incorreta" },
killedBy: DELETE /api/users/delete TDD-FAIL: deve retornar 400 se a senha estiver incorreta
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Survived] BooleanLiteral
api/users/delete/route.js:50:22
 
       if (!isPasswordValid) {
         return NextResponse.json(
-          { success: false, message: "Senha incorreta" },
+          { success: true, message: "Senha incorreta" },
           { status: 400 }
         )

[Killed] StringLiteral
api/users/delete/route.js:50:38
 
       if (!isPasswordValid) {
         return NextResponse.json(
-          { success: false, message: "Senha incorreta" },
+          { success: false, message: "" },
           { status: 400 }
         )
killedBy: DELETE /api/users/delete TDD-FAIL: deve retornar 400 se a senha estiver incorreta
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Senha incorreta"
Received: ""

[Killed] BlockStatement
api/users/delete/route.js:57:60
     }
 
     // Deleta o usuário e suas sessões/contas relacionadas
-    const result = await prisma.$transaction(async (tx) => {
-      // Deleta sessões
-      await tx.session.deleteMany({
-        where: { userId: currentUser.id }
-      })
-
-      // Deleta contas
-      await tx.account.deleteMany({
-        where: { userId: currentUser.id }
-      })
-
-      // Deleta o usuário
-      const deletedUser = await tx.user.delete({
-        where: { id: currentUser.id },
-        select: {
-          id: true,
-          name: true,
-          email: true
-        }
-      })
-
-      return deletedUser
-    })
+    const result = await prisma.$transaction(async (tx) => {})
 
     return NextResponse.json({
killedBy: DELETE /api/users/delete TDD-SUCCESS: deve deletar o usuário e retornar 200
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] ObjectLiteral
api/users/delete/route.js:64:35
       })
 
       // Deleta contas
-      await tx.account.deleteMany({
-        where: { userId: currentUser.id }
-      })
+      await tx.account.deleteMany({})
 
       // Deleta o usuário

[Survived] ObjectLiteral
api/users/delete/route.js:71:17
       // Deleta o usuário
       const deletedUser = await tx.user.delete({
         where: { id: currentUser.id },
-        select: {
-          id: true,
-          name: true,
-          email: true
-        }
+        select: {}
       })
 

[Survived] BooleanLiteral
api/users/delete/route.js:74:18
         select: {
           id: true,
           name: true,
-          email: true
+          email: false
         }
       })

[Killed] StringLiteral
api/users/delete/route.js:83:16
 
     return NextResponse.json({
       success: true,
-      message: "Conta deletada com sucesso",
+      message: "",
       data: {
         deletedUser: result
killedBy: DELETE /api/users/delete TDD-SUCCESS: deve deletar o usuário e retornar 200
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Conta deletada com sucesso"
Received: ""

[Killed] BlockStatement
api/users/delete/route.js:89:19
       }
     })
 
-  } catch (error) {
-    console.error("Delete error:", error)
-    return NextResponse.json(
-      { success: false, message: "Erro interno do servidor" },
-      { status: 500 }
-    )
-  }
+  } catch (error) {}
 }
killedBy: DELETE /api/users/delete TDD-COV: deve retornar 500 se ocorrer um erro interno do servidor
statusReason: TypeError: Cannot read properties of undefined (reading 'json')

[Survived] StringLiteral
api/users/delete/route.js:90:19
     })
 
   } catch (error) {
-    console.error("Delete error:", error)
+    console.error("", error)
     return NextResponse.json(
       { success: false, message: "Erro interno do servidor" },
