[Killed] BlockStatement
api/users/search/route.js:12:46
     const { searchParams } = new URL(request.url)
     const query = searchParams.get('q')
 
-    if (!query || query.trim().length === 0) {
-      return NextResponse.json({ 
-        success: true,
-        data: [],
-        message: "Query de busca não fornecida"
-      })
-    }
+    if (!query || query.trim().length === 0) {}
 
     const users = await prisma.user.findMany({
killedBy: GET /api/users/search deve retornar 200 e mensagem se a query 'q' não for fornecida
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 7

- Array []
+ Array [
+   Object {

[Killed] BooleanLiteral
api/users/search/route.js:12:9
     const { searchParams } = new URL(request.url)
     const query = searchParams.get('q')
 
-    if (!query || query.trim().length === 0) {
+    if (query || query.trim().length === 0) {
       return NextResponse.json({ 
         success: true,
killedBy: GET /api/users/search deve retornar 200 e mensagem se a query 'q' não for fornecida
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] ObjectLiteral
api/users/search/route.js:13:32
     const query = searchParams.get('q')
 
     if (!query || query.trim().length === 0) {
-      return NextResponse.json({ 
-        success: true,
-        data: [],
-        message: "Query de busca não fornecida"
-      })
+      return NextResponse.json({})
     }
 
killedBy: GET /api/users/search deve retornar 200 e mensagem se a query 'q' não for fornecida
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: undefined

[Survived] ObjectLiteral
api/users/search/route.js:37:15
           }
         ]
       },
-      select: {
-        id: true,
-        name: true,
-        email: true,
-        image: true,
-        createdAt: true
-      },
+      select: {},
       take: 20, // Limita a 20 resultados
       orderBy: {

[Survived] BooleanLiteral
api/users/search/route.js:42:20
         name: true,
         email: true,
         image: true,
-        createdAt: true
+        createdAt: false
       },
       take: 20, // Limita a 20 resultados

[Survived] StringLiteral
api/users/search/route.js:46:15
       },
       take: 20, // Limita a 20 resultados
       orderBy: {
-        name: 'asc'
+        name: ""
       }
     })

[Killed] BlockStatement
api/users/search/route.js:57:19
       query: query
     })
     
-  } catch (error) {
-    console.error("Search error:", error)
-    return NextResponse.json(
-      { 
-        success: false, 
-        message: "Erro interno do servidor",
-        data: []
-      },
-      { status: 500 }
-    )
-  }
+  } catch (error) {}
 }
killedBy: GET /api/users/search deve retornar 500 se ocorrer um erro interno do servidor (catch block)
statusReason: TypeError: Cannot read properties of undefined (reading 'json')

[Killed] BooleanLiteral
api/users/search/route.js:61:18
     console.error("Search error:", error)
     return NextResponse.json(
       { 
-        success: false, 
+        success: true, 
         message: "Erro interno do servidor",
         data: []
killedBy: GET /api/users/search deve retornar 500 se ocorrer um erro interno do servidor (catch block)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] StringLiteral
api/users/search/route.js:62:18
     return NextResponse.json(
       { 
         success: false, 
-        message: "Erro interno do servidor",
+        message: "",
         data: []
       },
killedBy: GET /api/users/search deve retornar 500 se ocorrer um erro interno do servidor (catch block)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Erro interno do servidor"
Received: ""

[Killed] ObjectLiteral
api/users/search/route.js:65:7
         message: "Erro interno do servidor",
         data: []
       },
-      { status: 500 }
+      {}
     )
   }
killedBy: GET /api/users/search deve retornar 500 se ocorrer um erro interno do servidor (catch block)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 200
